src/DataProcessors/InteractiveExportModification.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<DataProcessor>
		<Properties>
			<Name>InteractiveExportModification</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ExportVariant</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AllDocumentsFilterPeriod</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AllDocumentsComposerAddress</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>NodeScenarioFilterPeriod</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AdditionalNodeScenarioRegistration</Name>
					<Type>
						<v8:Type>v8:ValueTable</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>NodeScenarioFilterPresentation</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AdditionScenarioParameters</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CurrentSettingsItemPresentation</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>InfobaseNode</Name>
					<Type>
						<v8:TypeSet>cfg:ExchangePlanRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AllDocumentsFilterComposer</Name>
					<Type>
						<v8:Type>dcsset:SettingsComposer</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AdditionalRegistration</Name>
					<Comment>Additional registration table</Comment>
					<Type>
						<v8:Type>v8:ValueTable</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>FromStorageAddress</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/Enums/ExchangeObjectExportModes.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<Enum>
		<Properties>
			<Name>ExchangeObjectExportModes</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>UnloadAlways</Name>
					<Comment>Export without of applying filters.</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ExportByCondition</Name>
					<Comment>Export with applying filters.</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ExportIfNecessary</Name>
					<Comment>Export without of applying filters, but with control of reference integrity of exported data.</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ManualExport</Name>
					<Comment>In this mode object changes are not registered automatically (using event subscriptions). Objects are registered manually by a user. Object are exported only if they match the filter of the node that is used for data export.</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>NotExport</Name>
					<Comment>In this mode object changes are not registered automatically (using event subscriptions) and are not exported, even if object changes were registered manually by a user.</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/DataProcessors/InteractiveExportModification/Forms/NodeContentObjectKindSelection/Ext/Form/Module.bsl
#Region FormEventHandlers
//

&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	
  // Skipping the initialization to guarantee that the form will be
  // received if the Autotest parameter is passed.
	If Parameters.Property("Autotest") Then
		Return;
	EndIf;
	
	CloseOnOwnerClose = True;
	CloseOnChoice = False;
	
	Object.InfobaseNode = Parameters.InfobaseNode;
	
	SelectionTree = FormAttributeToValue("AvailableObjectKinds");
	SelectionTreeRows = SelectionTree.Rows;
	SelectionTreeRows.Clear();
	
	AllData = DataExchangeServer.NodeContentRefTables(Object.InfobaseNode);

	// If "NotExport" is set for some item, it is removed from AllData
	NotExportMode = Enums.ExchangeObjectExportModes.NotExport;
	ExportModes   = DataExchangeCached.UserExchangePlanContent(Object.InfobaseNode);
	Position = AllData.Count()-1;
	While Position>=0 Do
		DataRow = AllData[Position];
		If ExportModes[DataRow.FullMetadataName]=NotExportMode Then
			AllData.Delete(Position);
		EndIf;
		Position = Position - 1;
	EndDo;
	
	// Removing standard metadata picture
	AllData.FillValues(-1, "PictureIndex");
	
	AddAllObjects(AllData, SelectionTreeRows);
	
	ValueToFormAttribute(SelectionTree, "AvailableObjectKinds");
	
	ColumnsToSelect = "";
	For Each Attribute In GetAttributes("AvailableObjectKinds") Do
		ColumnsToSelect = ColumnsToSelect + "," + Attribute.Name;
	EndDo;
	ColumnsToSelect = Mid(ColumnsToSelect, 2);
	
EndProcedure

#EndRegion

#Region AvailableObjectKindFormTableElementEventHandlers

&AtClient
Procedure AvailableObjectKindSelection(Item, SelectedRow, Field, StandardProcessing)
	ExecuteSelection(SelectedRow);
EndProcedure

#EndRegion

#Region FormCommandHandlers

&AtClient
Procedure OKCommand(Command)
	ExecuteSelection();
EndProcedure

#EndRegion

#Region InternalProceduresAndFunctions

&AtServer
Function ThisObject(NewObject=Undefined)
	If NewObject=Undefined Then
		Return FormAttributeToValue("Object");
	EndIf;
	ValueToFormAttribute(NewObject, "Object");
	Return Undefined;
EndFunction

&AtClient
Procedure ExecuteSelection(SelectedRow=Undefined)
	
	FormTable = Items.AvailableObjectKinds;
	ChoiceData = New Array;
	
	If SelectedRow=Undefined Then
		For Each Row In FormTable.SelectedRows Do
			ChoiceItem = New Structure(ColumnsToSelect);
			FillPropertyValues(ChoiceItem, FormTable.RowData(Row) );
			ChoiceData.Add(ChoiceItem);
		EndDo;
		
	ElsIf TypeOf(SelectedRow)=Type("Array") Then
		For Each Row In SelectedRow Do
			ChoiceItem = New Structure(ColumnsToSelect);
			FillPropertyValues(ChoiceItem, FormTable.RowData(Row) );
			ChoiceData.Add(ChoiceItem);
		EndDo;
		
	Else
		ChoiceItem = New Structure(ColumnsToSelect);
		FillPropertyValues(ChoiceItem, FormTable.RowData(SelectedRow) );
		ChoiceData.Add(ChoiceItem);
	EndIf;
	
	NotifyChoice(ChoiceData);
EndProcedure

&AtServer
Procedure AddAllObjects(AllRefNodeData, TargetRows)
	
	ThisDataProcessor = ThisObject();
	
	DocumentGroup = TargetRows.Add();
	DocumentGroup.ListPresentation = ThisDataProcessor.AllDocumentsFilterGroupTitle();
	DocumentGroup.FullMetadataName = ThisDataProcessor.AllDocumentsID();
	DocumentGroup.PictureIndex = 7;
	
	CatalogGroup = TargetRows.Add();
	CatalogGroup.ListPresentation = ThisDataProcessor.AllCatalogsFilterGroupTitle();
	CatalogGroup.FullMetadataName = ThisDataProcessor.AllCatalogsID();
	CatalogGroup.PictureIndex = 3;
	
	For Each Row In AllRefNodeData Do
		If Row.SelectPeriod Then
			FillPropertyValues(DocumentGroup.Rows.Add(), Row);
		Else
			FillPropertyValues(CatalogGroup.Rows.Add(), Row);
		EndIf;
	EndDo;
	
	// Deleting empty items
	If DocumentGroup.Rows.Count()=0 Then
		TargetRows.Delete(DocumentGroup);
	EndIf;
	If CatalogGroup.Rows.Count()=0 Then
		TargetRows.Delete(CatalogGroup);
	EndIf;
	
EndProcedure

#EndRegion
